hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
    if (MBB->succ_size() == 1) {
      // There is only one successor, so the next block is statically known
      BBI.Next = *MBB->succ_begin();
    }

    // Analyze branch
    if (!TII->analyzeBranch(*MBB, BBI.TrueBB, BBI.FalseBB, BBI.BrCond)) {
      // analyzeBranch can invalidate the previous fall-through analysis
      BBI.FallThroughBB  = MBB->getFallThrough();
      BBI.IsAnalyzable = true;

      if (BBI.TrueBB != nullptr) {
        BBI.IsBranch = true;
        BBI.IsConditionalBranch = !BBI.BrCond.empty();

        if (BBI.IsConditionalBranch) {
          if (BBI.FalseBB == nullptr) {
            //LLVM_DEBUG(dbgs() << *BBI.BB);
            // This MBB must end with a conditional branch and a fallthrough.
            assert(BBI.FallThroughBB != nullptr);
            assert(BBI.FallThroughBB != BBI.TrueBB);
            BBI.FalseBB = BBI.FallThroughBB;
          }
          else {
            // This MBB must end with an unconitional branch followed by an
            //  unconditional.
            if (BBI.FallThroughBB != nullptr) {
              // There is an explicit branch to the fallthrough block (see
              //    code MBB::getFallThrough())
              // TODO: Optimize by removing one of the jumps (which might
              //        require to inverse the condition)
              BBI.FallThroughBB = nullptr;
            }
          }
        }
        else {
          // This must be an unconditonal branch
          if (BBI.FallThroughBB != nullptr) {
            // There is an explicit branch to the fallthrough block
            // TODO: Optimize by removing the branching code
            //       Delete the JMP if it's equivalent to a fall-through.
            BBI.FallThroughBB = nullptr;
          }
        }
      } else {
        // This must be a pure fallthrough block
        assert(BBI.TerminatorCount == 0);
        assert(BBI.FallThroughBB != nullptr);
      }
    } else {
      // There should be exactly one terminator
      assert(BBI.TerminatorCount == 1);
      assert(++(MBB->terminators().begin()) == MBB->terminators().end());
      MachineInstr *I = &*MBB->getFirstTerminator();

      if (I->isReturn()) {
        BBI.IsAnalyzable = true;
        BBI.IsReturn = true;
        assert(BBI.BB->isReturnBlock());
      }
    }
  }

  // Block cannot be analyzed
  if (! BBI.IsAnalyzable) {
    // Reject code that cannot be analyzed
    //  The RemoveTerminationCode (called by ComputeSuccessors) for example,
    //  depends on analyzable blocks.
    llvm_unreachable("TODO: Handle this case.");
  }
}

// !TODO: Fix this (RegUnit is a different concept than initialy thought...)
//         The analysis should mark every RegUnit as definded or used!
static size_t getRegUnit(const TargetRegisterInfo *TRI, size_t Reg) {
  MCRegUnitIterator RUI(Reg, TRI);
  assert(RUI.isValid());
  size_t RU = *RUI;
  ++RUI;
  assert(!RUI.isValid());
  return RU;
}

void MSP430NemesisDefenderPass::RegisterDefs(MBBInfo &BBI) {
  /// Current instruction number.
  size_t CurInstr = 0;
  for (MachineInstr &MI : BBI.BB->instrs()) {
    for (auto MO : MI.operands()) {
      // TODO: For now, only consider registers
      // TODO: To be portable, deal with two-operand instructions where
      //         a register can be both defined and used
      if (MO.isReg() && (!MO.isUse())) {
        assert(MO.getReg() > 0);
        assert(MO.isDef());
        auto RU = getRegUnit(TRI, MO.getReg());
        assert(RU < TRI->getNumRegUnits());
        assert(RU < BBI.Defs.size());
        BBI.Defs[RU].push_back(CurInstr);
      }
    }

    InstIds[&MI] = CurInstr;
    CurInstr++;
  }
}

MSP430NemesisDefenderPass::MBBInfo *
MSP430NemesisDefenderPass::GetInfo(MachineBasicBlock &MBB) {
#if 0  // Re-enable when BBAnalysis is a vector
  size_t N = MBB.getNumber();
  assert(N < BBAnalysis.size() && "Unexpected basic block number");
  return &BBAnalysis[N];
#else
  return &BBAnalysis[&MBB];
#endif
}

void MSP430NemesisDefenderPass::AnalyzeControlFlow(MachineBasicBlock &MBB) {
  auto BBI = GetInfo(MBB);

  if (! BBI->IsDone) {
    BBI->BB = &MBB;
    BBI->Defs.resize(TRI->getNumRegUnits());
    BBI->Deps.resize(MBB.size());

    AnalyzeControlFlow(*BBI);
    RegisterDefs(*BBI);

    BBI->IsDone = true;
  }
}

/// analyzeCompare - For a comparison instruction, return the source registers
/// in SrcReg and SrcReg2 if having two register operands, and the value it
/// compares against in CmpValue. Return true if the comparison instruction
/// can be analyzed.
bool MSP430NemesisDefenderPass::analyzeCompare(
    const MachineInstr &MI, unsigned &SrcReg, unsigned &SrcReg2, int &CmpMask,
    int &CmpValue) const {
  switch (MI.getOpcode()) {
    default: break;
    case MSP430::CMP8ri:
    case MSP430::CMP8rc:
    case MSP430::CMP16ri:
    case MSP430::CMP16rc:
      SrcReg = MI.getOperand(0).getReg();
      SrcReg2 = 0;
      CmpMask = ~0;
      CmpValue = MI.getOperand(1).getImm();
      return true;
    case MSP430::SUB8ri:
    case MSP430::SUB8rc:
    case MSP430::SUB16ri:
    case MSP430::SUB16rc:
      SrcReg = MI.getOperand(0).getReg();
      SrcReg2 = 0;
      CmpMask = ~0;
      CmpValue = MI.getOperand(2).getImm();
      return true;
    case MSP430::CMP8rr:
    case MSP430::CMP16rr:
      SrcReg = MI.getOperand(0).getReg();
      SrcReg2 = MI.getOperand(1).getReg();
      CmpMask = ~0;
      CmpValue = 0;
      return true;
    case MSP430::BIT8ri:
    case MSP430::BIT16ri:
      SrcReg = MI.getOperand(0).getReg();
      SrcReg2 = 0;
      CmpMask = MI.getOperand(1).getImm();
      CmpValue = 0;
      return true;
    case MSP430::CMP16mc:
    case MSP430::CMP16mi:
    case MSP430::CMP16mm:
    case MSP430::CMP16mn:
    case MSP430::CMP16mp:
    case MSP430::CMP16mr:
    case MSP430::CMP16rm:
    case MSP430::CMP16rn:
    case MSP430::CMP16rp:
    case MSP430::CMP8mc:
    case MSP430::CMP8mi:
    case MSP430::CMP8mm:
    case MSP430::CMP8mn:
    case MSP430::CMP8mp:
    case MSP430::CMP8mr:
    case MSP430::CMP8rm:
    case MSP430::CMP8rn:
    case MSP430::CMP8rp:
    case MSP430::BIT16mc:
    case MSP430::BIT16mi:
    case MSP430::BIT16mm:
    case MSP430::BIT16mn:
    case MSP430::BIT16mp:
    case MSP430::BIT16mr:
    case MSP430::BIT16rc:
    case MSP430::BIT16rm:
    case MSP430::BIT16rn:
    case MSP430::BIT16rp:
    case MSP430::BIT16rr:
    case MSP430::BIT8mc:
    case MSP430::BIT8mi:
    case MSP430::BIT8mm:
    case MSP430::BIT8mn:
    case MSP430::BIT8mp:
    case MSP430::BIT8mr:
    case MSP430::BIT8rc:
    case MSP430::BIT8rm:
    case MSP430::BIT8rn:
    case MSP430::BIT8rp:
    case MSP430::BIT8rr:
      // TODO
      return false;
  }

