hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
  return false;
}

static bool Defines(MachineOperand &MO, unsigned Reg) {
  return (MO.isReg() && MO.isDef() && (MO.getReg() == Reg));
}

static bool IsCopyConstant(MachineInstr *MI, int &V) {
  switch(MI->getOpcode()) {
    case MSP430::MOV8ri:
    case MSP430::MOV16ri:
    case MSP430::MOV8rc:
    case MSP430::MOV16rc:
      V = MI->getOperand(1).getImm();
      return true;
  }
  return false;
}

static bool IsAddConstant(MachineInstr *MI, int &V) {
  switch(MI->getOpcode()) {
    case MSP430::ADD8ri:
    case MSP430::ADD16ri:
    case MSP430::ADD8rc:
    case MSP430::ADD16rc:
      V = MI->getOperand(2).getImm();
      return true;
    case MSP430::SUB8ri:
    case MSP430::SUB16ri:
    case MSP430::SUB8rc:
    case MSP430::SUB16rc:
      V = -MI->getOperand(2).getImm();
      return true;
  }
  return false;
}

static MSP430CC::CondCodes reverseCondCode(MSP430CC::CondCodes CC) {
  switch (CC) {
    case MSP430CC::COND_E : return MSP430CC::COND_NE;
    case MSP430CC::COND_NE: return MSP430CC::COND_E;
    case MSP430CC::COND_L : return MSP430CC::COND_GE;
    case MSP430CC::COND_GE: return MSP430CC::COND_L;
    case MSP430CC::COND_HS: return MSP430CC::COND_LO;
    case MSP430CC::COND_LO: return MSP430CC::COND_HS;
    default: llvm_unreachable("Invalid cond code");
  }
}

// TODO: MSP430 specific
int MSP430NemesisDefenderPass::GetLoopTripCount(MachineLoop *L) {

  assert(L->getHeader() != nullptr);

  // Get the unique loop predecessor. This is required to be able to
  //  determine the initial value of the loop's induction variable.
  auto *Pre = L->getLoopPredecessor();
  assert(Pre != nullptr);

  // Get unique loop control block
  MachineBasicBlock *ControlBlock = L->findLoopControlBlock();
  if (ControlBlock == nullptr)
    llvm_unreachable("No unique exit block");

  assert(ControlBlock == L->getLoopLatch());

  // Get the compare instruction, or to be more precise the instruction that
  //  defines SR. Require it to be in the exit block.
  MachineInstr *CMPI = nullptr;
  auto TI = ControlBlock->getFirstTerminator();
  assert(TI != ControlBlock->end());
  auto II = ControlBlock->begin();
  while (II != TI) {
    // !TODO: Optimize, use BBI->Defs for this and start looking from the end
    //             of MBB
    for (auto &MO : II->operands()) {
      if (Defines(MO, MSP430::SR)) {
        CMPI = &*II;
      }
    }
    II++;
  }
  assert(CMPI != nullptr);

  // Analyze the compare instruction, or to be more precise the instruction
  //  that defines SR
  unsigned IVReg, Reg2;
  int CmpMask, CmpValue;
  if (! analyzeCompare(*CMPI, IVReg, Reg2, CmpMask, CmpValue))
    llvm_unreachable("Unable to analyze compare (1)");

  assert(IVReg != 0);
  if (Reg2 != 0) {
    MF->viewCFG();
    LLVM_DEBUG(dbgs() << GetName(L->getHeader()) << "\n");
    llvm_unreachable("Unable to analyze compare (2)");
  }
  //assert(CmpValue != 0);
  //assert(CmpMask == ~0);

  // Find out where IVReg (induction variable register) is updated
  //   For now, require that this is in the predecessor block
  MachineInstr *IVInI = nullptr;
  while ( (Pre != nullptr) && (IVInI == nullptr) ) {
    II = Pre->begin();
    TI = Pre->getFirstTerminator();
    while (II != TI) {
      // !TODO: Optimize, use BBI->Defs for this and start looking from the end
      //             of MBB
      for (auto &MO : II->operands()) {
        if (Defines(MO, IVReg)) {
          IVInI = &*II;
        }
      }
      II++;
    }

    /* Keep searching as long as there is a unique predecessor */
    if (Pre->pred_size() == 1) {
      Pre = *Pre->pred_begin();
    }
  }
  assert(IVInI != nullptr);

  assert(IVInI->getOperand(0).getReg() == IVReg);
  int IVInV;
  if (! IsCopyConstant(IVInI, IVInV)) {
    llvm_unreachable("Mov expected");
  }

  // Find out where IVReg (induction variable register) is updated
  //   For now, require that this is in the exit block
  II = ControlBlock->begin();
  TI = ControlBlock->getFirstTerminator();
  MachineInstr *IVUpI = nullptr;
  while (II != TI) {
    // !TODO: Optimize, use BBI->Defs for this and start looking from the end
    //             of MBB
    for (auto &MO : II->operands()) {
      if (Defines(MO, IVReg)) {
        IVUpI = &*II;
      }
    }
    II++;
  }
  assert(IVUpI != nullptr);

  assert(IVUpI->getOperand(0).getReg() == IVReg);
  int IVUpV;
  if (! IsAddConstant(IVUpI, IVUpV)) {
    llvm_unreachable("Add expected");
  }

  // Compute trip count
  int TripCount = 0;
  auto BBI = GetInfo(*ControlBlock);
  assert(BBI->BrCond.size() == 1);
  auto CC = static_cast<MSP430CC::CondCodes>(BBI->BrCond[0].getImm());
  if (L->contains(BBI->FalseBB)) {
    //MF->viewCFG();
    LLVM_DEBUG(dbgs() << GetName(L->getHeader()) << "\n");
    assert(! L->contains(BBI->TrueBB));
    CC = reverseCondCode(CC);
  }
  else {
    assert(L->contains(BBI->TrueBB));
  }

  switch (CC) {
    /* JC, JHS */
    case MSP430CC::COND_HS:
      assert(IVInV > CmpValue);
      assert(IVUpV < 0);
      TripCount = (CmpValue - IVInV) / (IVUpV); // TODO
      break;

    /* JNC, JLO */
    case MSP430CC::COND_LO:
      assert(IVInV < CmpValue);
      assert(IVUpV > 0);
      TripCount = (CmpValue - IVInV) / (IVUpV); // TODO
      break;

    /* JNE, JNZ */
    case MSP430CC::COND_NE:
      if (IVInV < CmpValue) {
        assert(IVUpV > 0);
        TripCount = (CmpValue - IVInV) / (IVUpV); // TODO
      }
      else {
        assert(IVInV > CmpValue);
        assert(IVUpV < 0);
        TripCount = (CmpValue - IVInV) / (IVUpV); // TODO
      }
      break;

    /* JGE */
    case MSP430CC::COND_GE:
    /* JL */
    case MSP430CC::COND_L :
    /* JN */
    case MSP430CC::COND_N :
    /* JE, JZ */
    case MSP430CC::COND_E :
    default:
      llvm_unreachable("Unsupported condition code");
  }

  LLVM_DEBUG(dbgs() << "TRIP COUNT=" << TripCount);
  LLVM_DEBUG(dbgs() << " CC="    << CC);
  LLVM_DEBUG(dbgs() << " BEGIN=" << IVInV);
  LLVM_DEBUG(dbgs() << " STEP="  << IVUpV);
  LLVM_DEBUG(dbgs() << " END="   << CmpValue);
  LLVM_DEBUG(dbgs() << "\n");

  return TripCount;
}

void MSP430NemesisDefenderPass::AnalyzeControlFlow() {
  for (MachineBasicBlock &MBB : *MF) {
    AnalyzeControlFlow(MBB);
  }
}

void MSP430NemesisDefenderPass::ReAnalyzeControlFlow(MachineBasicBlock &MBB) {
  auto BBI = GetInfo(MBB);

  // TODO: Not every field below should be reset
  //         (maybe its better to move this code to the MBBInfo struct)
  BBI->IsDone = false;
  // IsAligned status cannot be reset
  //BBI->IsAligned = false;
  BBI->IsAnalyzable = false;
  BBI->IsBranch = false;
  BBI->IsConditionalBranch = false;
  // HasSecretDependentBranch is set in PerformTaintAnalysis, not in
  //  AnalyzeControlFlow
  //BBI->HasSecretDependentBranch = false; 
  // IsPartOfSensitiveRegion is set during outer region analysis
  /// BBI->IsPartOfSensitiveRegion
  BBI->IsEntry = false;
  BBI->IsReturn = false;
  BBI->BB = nullptr;
  // There is no need to reset the original contents
  //BBI->Orig = nullptr;

  // Dont' touch loop analysis (loop analysis should not change)
  // BBI->IsLoopHeader = false;
  // BBI->TripCount = 0;
  BBI->Next = nullptr;
  BBI->TrueBB = nullptr;
  BBI->FalseBB = nullptr;
  BBI->FallThroughBB = nullptr;
  BBI->TerminatorCount = 0;
  BBI->BrCond.clear();
  BBI->Defs.clear();
  BBI->Deps.clear();
  std::memset(&BBI->BCInfo, 0, sizeof(BBI->BCInfo));

  AnalyzeControlFlow(MBB);
}

