hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
// Verify the analysis results, assert assumptions
// Also check well-formedness criterion of termination code
//   (or does this belong in the AnalyzeControlFlow method ?)
void MSP430NemesisDefenderPass::VerifyControlFlowAnalysis() {
  // Every block should have been analyzed
  for (MachineBasicBlock &MBB : *MF) {
#if 0  // Re-enable when BBAnalysis is a vector
    size_t N = MBB.getNumber();
    assert(N < BBAnalysis.size() && "Unexpected basic block number");
    assert(BBAnalysis[N].IsDone);
#else
    assert(BBAnalysis.find(&MBB) != BBAnalysis.end());
    assert(BBAnalysis[&MBB].IsDone);
#endif
    auto BBI = GetInfo(MBB);

    // Verify well-formedness criterion
    if (BBI->IsAnalyzable) {
      //
      // o Maximum two termination instructions are allowed
      assert(BBI->TerminatorCount <= 2);

      // o For unconditional branches, only the following addressing modes
      //       will be supported. Reject all others (set IsAnalyzable to false).
      //   - immediate (3 cycles)
      //   - symbolic (3 cycles)
      //   - absolute (3 cycles)
      // TODO
    }
  }

  // There should be exaclty one entry point
  assert(EntryBBI != nullptr);
  assert(EntryBBI->BB == GetEntryMBB(MF) && "Unexpected entry block");
  assert(std::count_if(BBAnalysis.begin(), BBAnalysis.end(),
                       [](std::pair<const MachineBasicBlock *, MBBInfo> x) {
                         return x.second.IsEntry;
                       }) == 1);
}

// Returns all the definitions of register unit RU in BII.BB for which
//   predicate P evaluates to true
std::vector<size_t>
MSP430NemesisDefenderPass::GetDefs(MBBInfo *BBI, size_t RU,
                                   std::function<bool(size_t)> P) {
  std::vector<size_t> R;
  R.resize(BBI->Defs[RU].size());
  auto I =
    std::copy_if(BBI->Defs[RU].begin(), BBI->Defs[RU].end(), R.begin(), P);
  R.resize(std::distance(R.begin(), I));
  return R;
}

// Returns all the definitions of register unit RU in BII.BB that come before
// the given instruction identifier.
std::vector<size_t>
MSP430NemesisDefenderPass::GetDefsBefore(MBBInfo *BBI, size_t RU, size_t IID) {
  return GetDefs(BBI, RU, [IID](size_t DIID) { return DIID < IID; });
}

// Returns all the definitions of register unit RU in BII.BB that come after
// the given instruction identifier.
std::vector<size_t>
MSP430NemesisDefenderPass::GetDefsAfter(MBBInfo *BBI, size_t RU, size_t IID) {
  return GetDefs(BBI, RU, [IID](size_t DIID) { return DIID > IID; });
}

// TODO: It is the responsibility of callers to CreateMachineBasicBlock to call
//  AnalyzeControlFlow on the created block when appropriate. This should be
//  made more robust and future proof as callers are probably going to forget
//  this.
MachineBasicBlock * MSP430NemesisDefenderPass::CreateMachineBasicBlock(
    StringRef debug, bool addToMF) {
  MachineBasicBlock *MBB = MF->CreateMachineBasicBlock(nullptr);
  if (addToMF) {
    MF->push_back(MBB);
  }
  LLVM_DEBUG(dbgs() << "New MBB: " << GetName(MBB) << " (" << debug << ")\n");
  return MBB;
}

// Clones a MBB (contents only)
// TODO: It is the responsibility of callers to CloneBlock to call
//  AnalyzeControlFlow on the created block when appropriate. This should be
//  made more robust and future proof as callers are probably going to forget
//  this.
MachineBasicBlock *MSP430NemesisDefenderPass::CloneMBB(
    MachineBasicBlock *MBB, bool addToMF) {
  //LLVM_DEBUG(dbgs() << "Cloning " << GetName(MBB) << "\n");
  MachineBasicBlock *Clone = CreateMachineBasicBlock("clone", addToMF);
  for (auto &MI : *MBB) {
    // TODO: Use MF->CloneMachineInstrBundle() ?
    Clone->push_back(MF->CloneMachineInstr(&MI));
    // TODO: What is the difference with MI.Clone() ?
    //
    //!!TODO How to deal with instruction that refer to other MBBs
    //        and that are no jump-instructions (e.g. just take the adresss
    //        of a MBB, ...)
    //        In the clone they should probably refer to another MBB
    //        This should be handled case by case, just as changing the
    //        termination instructions of the clone, and as adapting the
    //        CFG ...
  }

  // Keep track of the original contents
  // TODO: This should be refactored (addToMF is a bad name to start with)
  //        addToMF is only false, when the original clone is being made
  //        (original clone has a block number of -1)
  //        in all other cases, the MBB is the original clone
  if (addToMF) {
    assert(MBB->getNumber() == -1);
    GetInfo(*Clone)->Orig = MBB;
  }

  return Clone;
}

/// Removes the branching code at the end of the specific MBB.
/// Non-branching termination code is ignored.
/// TODO: This function is redundant to TII->removeBranch(MBB)
void MSP430NemesisDefenderPass::RemoveTerminationCode(MachineBasicBlock &MBB) {
  MBBInfo *BBI = GetInfo(MBB);
  assert(BBI->IsAnalyzable);

  if (BBI->IsBranch) {
    assert(BBI->TerminatorCount > 0);
    TII->removeBranch(MBB);
  }
  else if (BBI->IsReturn) {
    MachineBasicBlock::iterator I = MBB.end();
    I--;
    assert(I->getOpcode() == MSP430::RET);
    I->eraseFromParent();
  }
  else {
    // This must be a pure fallthrough block
    //  So, no branch to remove
    assert (BBI->TerminatorCount == 0);
    assert(BBI->FallThroughBB != nullptr);
  }
}

// Updates CFG, BB analysis and the MBBs' termination code accordingly
//
// Re-analyzes the CF for MBB
void MSP430NemesisDefenderPass::ReplaceSuccessor(
    MachineBasicBlock *MBB, MachineBasicBlock *Old, MachineBasicBlock *New) {

  assert(MBB->isSuccessor(Old));

  DebugLoc DL; // FIXME: Where to get DebugLoc from?

  // 1. Update CFG (A correct CFG is a precondition for TII->insertBranch)
  MBB->replaceSuccessor(Old, New);

  // 2. Update termination code
  RemoveTerminationCode(*MBB);
  auto BBI = GetInfo(*MBB);
  if (BBI->IsBranch) {
    if (BBI->TrueBB == Old) BBI->TrueBB = New;
    if (BBI->FalseBB == Old) BBI->FalseBB = New;
    if (BBI->IsConditionalBranch) {
      TII->insertBranch(*MBB, BBI->TrueBB, BBI->FalseBB, BBI->BrCond, DL);
    }
    else {
      assert(BBI->FallThroughBB == nullptr);
      TII->insertBranch(*MBB, BBI->TrueBB, nullptr, {}, DL);
    }
  }
  else {
    assert(! BBI->IsReturn); // A block with a successor cannot return
    assert(BBI->FallThroughBB != nullptr);
    assert(BBI->FallThroughBB == Old);
    BBI->FallThroughBB = nullptr;
    TII->insertBranch(*MBB, New, nullptr, {}, DL);
  }

  // Update control-flow analysis
  ReAnalyzeControlFlow(*MBB);
}

// !TODO: Should it be "MOV16rc" or "MOV16ri" ??? (because of immediate
//        value of one) (look also at other places for this choice)
//      REMARK: When *rc variant is used, "nop" is generated instead of
//      instruction  in the case of the dummy instructions
//          (see buildNop1, buildNop2,...). and consequently, test-nemdef
//          unit test suite fails.
static void BuildNOP1(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
  DebugLoc DL; // FIXME: Where to get DebugLoc from?

