hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
  // MOV  #0, R3       ; 1 cycle , 1 word
  BuildMI(MBB, I, DL, TII->get(MSP430::MOV16ri), MSP430::CG).addImm(0);
}

static void BuildNOP2(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
  DebugLoc DL; // FIXME: Where to get DebugLoc from?

#if 0
  // TODO: This might be problemtic, as entering a JMP in the middle
  //        of a MBB breaks the well-formedness of the MBB
  // JMP  $+2          ; 2 cycles, 1 word
  BuildMI(MBB, I, DL, TII->get(MSP430::JMP)).addImm(0);
#else
  // TODO: According to the the MSP430 manual, this is an illegal
  //        instruction, but OpenMSP430 seems to accept this.
  BuildMI(MBB, I, DL, TII->get(MSP430::MOV16ri), MSP430::CG).addImm(42);
#endif
}

static void BuildNOP3(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
  DebugLoc DL; // FIXME: Where to get DebugLoc from?

  // MOV  2(PC), R3    ; 3 cycles, 2 words
  BuildMI(MBB, I, DL, TII->get(MSP430::MOV16rm), MSP430::PC)
      .addReg(MSP430::CG)
      .addImm(2);
}

static void BuildNOP4(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
  DebugLoc DL; // FIXME: Where to get DebugLoc from?

  // BIC  #0, 0(R4)    ; 4 cycles, 2 words
  BuildMI(MBB, I, DL, TII->get(MSP430::BIC16mi), MSP430::FP)
      .addImm(0)
      .addImm(0);
}

static void BuildNOP5(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
  DebugLoc DL; // FIXME: Where to get DebugLoc from?

  // MOV  @R4, 0(R4)   ; 5 cycles, 2 words
  BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mn), MSP430::FP)
      .addImm(0)
      .addReg(MSP430::FP);
}

static void BuildNOP6(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
  DebugLoc DL; // FIXME: Where to get DebugLoc from?

  // MOV  0(R4), 0(R4) ; 6 cycles, 3 words
  BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mm), MSP430::FP)
      .addImm(0)
      .addReg(MSP430::FP)
      .addImm(0);
}

// TODO: MSP430 specific
// According to the MSP430 manual, a branch instruction always takes two cycles
// two execute, independent on whether a branch is taken or not
static void BuildBranchCompensator(MachineBasicBlock &MBB, 
                                   MachineBasicBlock::iterator I,
                                   const TargetInstrInfo *TII) {
  BuildNOP2(MBB, I, TII);
}

// Retrieves the fingerprint of the loop. The fingerprint is a slice of the 
//  loop,
//    a list of dummy instructions that represents a sequence of instruction
//    types in all possible paths of the aligned loop.

// Note that the fingerprint does not include the latch blocks of a loop
//  because it is not clear yet what the exact fingerprint of the latch block
//  will look like.
//
// PRE: The loop region (from header to latch) must be aligned for the
//       fingerprint to be correct. This means alignment of
//         - terminating instructions
//         - non-terminating instructions
//         - two-way branches
//
// Any control-flow path from loop-header to loop-latch should do, because
//  the loop region is already aligned (precondition) which means that all
//  possible paths from header to latch are observably equivalent.
//  Therefore, do a DFS traversal through the sensitive region.
std::shared_ptr<MSP430NemesisDefenderPass::Fingerprint>
MSP430NemesisDefenderPass::GetFingerprint(MachineLoop *L) {

  std::shared_ptr<Fingerprint> Result(new Fingerprint);

  MachineBasicBlock *FPBB = CreateMachineBasicBlock("fingerprint1", false);

  // Outer loop
  Result->LoopHeader = L->getHeader();
  assert(Result->LoopHeader != nullptr && "Loop is not well-formed");
  Result->Head = FPBB;

  // According to the well-formedness criterion, the last block of a DFS in
  //   any path should be the loop latch
  auto Latch = L->getLoopLatch();
  assert(Latch != nullptr);
  auto CurBB = L->getHeader();
  MachineBasicBlock *PrevBB = nullptr;

  // Make sure this loop terminates (i.e when latch post-dominates the header)
  assert(MPDT->dominates(Latch, CurBB));
  std::set<MachineBasicBlock *> Visited;

  while (CurBB != Latch) {
    assert(Visited.find(CurBB) == Visited.end());
    Visited.insert(CurBB);

    auto L2 = MLI->getLoopFor(CurBB);
    assert(L2 != nullptr);

    if (L2 != L) {
      assert(L2->getLoopPreheader() == PrevBB && "Well-formed loop expected");

      // Deal with nested loop
      FPBB = CreateMachineBasicBlock("fingerprint2", false);
      Result->Tail.push_back(std::make_pair(GetFingerprint(L2), FPBB));

      // Continue with thex loop-exit block
      assert(CurBB != nullptr && "Well-formed loop expected");
      PrevBB = CurBB;
      CurBB = L2->getExitBlock();
    }
    else {
      auto BBI = GetInfo(*CurBB);

      for (auto &MI : *CurBB) {
        if (MI.isCall()) {
          CompensateCall(MI, *FPBB, FPBB->end());
        }
        else {
          CompensateInstr(MI, *FPBB, FPBB->end());
        }
      }

      // All sensitive regions should be aligned by now, so the number
      // of statements should be the same, for any path that is taken
      // Still, caution has to be taken for two-way branches.
      if (BBI->IsConditionalBranch) {
        assert(CurBB->succ_size() == 2);
        // Follow the false path to avoid compensating for the
        //   1) the "JMP" instruction from the (JCC, JMP) pair _and_
        //   2) the JMP-compensated instruction in the true path
        // to the fingerprint.
        assert(BBI->BB->isSuccessor(BBI->TrueBB));
        assert(BBI->BB->isSuccessor(BBI->FalseBB));
        PrevBB = CurBB;
        CurBB = BBI->FalseBB;
      } else {
        assert(CurBB->succ_size() == 1);
        PrevBB = CurBB;
        CurBB = *CurBB->succ_begin();
      }
    }
  }

  return Result;
}

void MSP430NemesisDefenderPass::AlignTwoWayBranch(MachineBasicBlock &MBB) {
  DebugLoc DL; // FIXME: Where to get DebugLoc from?

  auto BBI = GetInfo(MBB);

  assert(BBI->HasSecretDependentBranch);
  assert(BBI->IsConditionalBranch && (BBI->FallThroughBB == nullptr) );
  assert(BBI->TerminatorCount == 2);

