hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
  auto T = MBB.getFirstTerminator();
  assert(T++->isConditionalBranch());
  assert(T++->isUnconditionalBranch());
  assert(T == MBB.end());

  LLVM_DEBUG(dbgs() << GetName(&MBB) << ": Align two-way branch\n");

#if 1
  // Compensate for the unconditional jump when the conditional jump has
  // been taken (in the true path).
  BuildBranchCompensator(*BBI->TrueBB, BBI->TrueBB->begin(), TII);
#else
  // Add a "jump block" between MBB and TrueBB to contain a single
  // unconditional jump statement)
  auto JBB = CreateMachineBasicBlock("align", true);
  BuildMI(*JBB, JBB->begin(), DL, TII->get(MSP430::JMP)).addMBB(BBI->TrueBB);
  JBB->addSuccessor(BBI->TrueBB);

  // Update MBB accordingly
  ReplaceSuccessor(&MBB, BBI->TrueBB, JBB);
  RemoveTerminationCode(MBB);
  TII->insertBranch(MBB, JBB, BBI->FalseBB, BBI->BrCond, DL);

  // Update control flow analysis
  ReAnalyzeControlFlow(MBB);
  AnalyzeControlFlow(*JBB);

  auto JBBI = GetInfo(*JBB);
  JBBI->Orig = CloneMBB(JBB, false); // TODO: Refactor the bookkeeping of 
                                     //        the original block contents
  assert(JBB->succ_size() == 1);
  assert(JBB->pred_size() == 1);
#endif
}

// Returns
//   1) when one of the direct successors represents the header of a loop
//      - Successors.Loop points to the detected loop
//      - Successors.Union represents the union of the direct successors of
//         every MMB in MBBs (modulo the Loop header )
//     The CFG will not be mutated.
//
//   2) otherwise
//      - Successors.Loop will be nullptr
//      - Successors.Union represents the union of the direct successors of
//         every MMB in MBBs
//      Possibly mutates the MF (and corresonding CFG) in order for the
//      preconditions of AlignBlocks() to be valid.
//
// PRE: All MBB in MBBs are part of a SESE-region
// POST: R.Union does not contain any duplicate blocks
//
// Param Exit is the "join block" or the "point of convergence" of the
// originating sensitive region.
//
// TODO: When a new basic block is added, a number of analyses, such
//   as CF analysis, have to be (re)done and some data structures,
//   such as the CFG, need to be maintained. This occurs at multiple
//   locations in this pass and should be factored out in a common
//   method.
MSP430NemesisDefenderPass::Successors
MSP430NemesisDefenderPass::ComputeSuccessors(
    std::vector<MachineBasicBlock *> MBBs, MachineBasicBlock *Exit) {
  LLVM_DEBUG(dbgs() << "> Compute successors: ");
  LLVM_DEBUG(for (auto MBB: MBBs) dbgs() << GetName(MBB) << ", ");
  LLVM_DEBUG(dbgs() << "\n");

  std::set<MachineBasicBlock *> Set;
  Successors R;
  R.Loop = nullptr;

  auto IsDone = [Exit](MachineBasicBlock * MBB) {
    return MBB->succ_size() == 1 && (*MBB->succ_begin() == Exit);
        // TODO: Check that the transformation in this pass does not invalidate
        //        the (post)dominator tree analysis
  };

  if ( ! std::all_of(MBBs.begin(), MBBs.end(), IsDone) ) {

    // Loop detector
    //   Deal with possible loops first
    //   => Check if one of the successors is the start of a new loop
    for (auto MBB : MBBs) {
      auto L1 = MLI->getLoopFor(MBB);
      for (auto S : MBB->successors()) {
        auto L2 = MLI->getLoopFor(S);
        if ((L2 != nullptr) && (L1 != L2)) {
          R.Loop = L2; // Loop found

          LLVM_DEBUG(dbgs() << "Loop found:"
                            << " header=" << GetName(L2->getHeader())
                            << " latch=" << GetName(L2->getLoopLatch())
                            << " exit=" << GetName(L2->getExitBlock())
                            << "\n");

          assert(MLI->isLoopHeader(S));
          // TODO: When a loop has more than one predecessor,
          //    getLoopPredecessor() returns nullptr. Fix this by duplicating
          //    the loop for every predecessor (can be optimized if every
          //    predecessor initializes the induction variable with the same
          //    value)
          // The LLVM MSP430 backend, for example, generates this kind of loop
          // when multiplying by two (see compound-conditional-expr.c)
          auto P = L2->getLoopPredecessor();
          assert(P != nullptr); // See comment above
          assert(P == MBB);
          assert(S->pred_size() == 2); // MBB and Latch
          assert(L2->getLoopPreheader() != nullptr);
          auto LL = L2->getLoopLatch();
          assert(L2->getLoopLatch() && "Loops with multiple latch blocks are not supported");
          auto E = L2->getExitBlock();
          assert(E && "Loops with multiple exit blocks are not supported");

          auto BBI = GetInfo(*LL);
          assert(BBI->IsConditionalBranch);
          assert(BBI->BrCond.size() == 1);
          assert(BBI->BB->succ_size() == 2); // See well-formedness criterion
          assert(BBI->TrueBB != nullptr);
          assert(BBI->FalseBB != nullptr);
          assert(L2->contains(BBI->TrueBB) || L2->contains(BBI->FalseBB));

#if 0
          auto IPDom = (*MPDT)[S]->getIDom(); // Immediate post-dominator
          assert(IPDom->getBlock() != nullptr && "Loop is not well-formed");
          assert(IPDom->getBlock() == E && "Loop is not well-formed");
#endif

          if (L2->contains(BBI->TrueBB)) {
            assert(!L2->contains(BBI->FalseBB));
          }
          else {
            assert(L2->contains(BBI->FalseBB));
          }

          break; /* The beginning of a loop is found. Stop looking.*/
        }
      }

      if (R.Loop != nullptr) /* A loop is found, stop looking.*/
        break;
    }

    if (R.Loop != nullptr) {

      // Deal with detected loop
      for (auto MBB : MBBs) {
        for (auto S : MBB->successors()) {
          if (S != R.Loop->getHeader()) {
            auto SBBI = GetInfo(*S);
            assert(! SBBI->IsAligned);

            // TODO: Blocks with the same successor can share an empty block
            auto EmptyMBB = CreateMachineBasicBlock("empty-for-loopif", true);
            GetInfo(*EmptyMBB)->Orig = CloneMBB(EmptyMBB, false);
            ReplaceSuccessor(MBB, S, EmptyMBB);
            EmptyMBB->addSuccessor(S);
            TII->insertBranch(*EmptyMBB, S, nullptr, {}, DebugLoc());
            AnalyzeControlFlow(*EmptyMBB);
            R.Union.push_back(EmptyMBB);
          }
        }
      }
    }
    else {
      R.Loop = nullptr;

      MachineBasicBlock *EmptyMBB = nullptr;

      // No loops found
      std::map<MachineBasicBlock *, MachineBasicBlock *> Clones; // DenseMap?
      for (auto MBB : MBBs) {
        for (auto S : MBB->successors()) {
          auto BBI = GetInfo(*MBB);
          auto SBBI = GetInfo(*S);

          // Ignore self-cycles
          // self-cycles should have been dealt with already, just like any
          // other loop (i.e. no single-block loop) inside a senstive region
          assert(S != MBB && (BBI->Orig != SBBI->Orig) && "Undetected loop");

          // !!TODO: Factor out the common logic between the three branches
          //          (when (S == Exit), (S == Return) and (S == Aligned))
          if (S == Exit) {

