hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
            // Create an empty block, if has not been created before, and
            // add CFG info and termination code. (A correct CFG is a precondition
            // for TII->insertBranch.)
            if (EmptyMBB == nullptr) {
              EmptyMBB = CreateMachineBasicBlock("empty", true);
              GetInfo(*EmptyMBB)->Orig = CloneMBB(EmptyMBB, false);
              // Update CFG
              EmptyMBB->addSuccessor(Exit);
              // Add termination code
              TII->insertBranch(*EmptyMBB, S, nullptr, {}, DebugLoc());

              R.Union.push_back(EmptyMBB);
            }

            // Update MBB
            assert((!BBI->IsReturn) && "Blocks with successors cannot return.");
            ReplaceSuccessor(MBB, S, EmptyMBB);

            // Create/update CF analysis for the new/changed blocks. This analysis
            //  is required by the alignment algo. Make sure to do this after
            //  updating the basic block's termination code and the CFG.
            //   (not sure if the CFG is actually used for this,
            //      but let's be conservative)
            ReAnalyzeControlFlow(
                *MBB); // TODO: Already done by ReplaceSuccessor
            ReAnalyzeControlFlow(*EmptyMBB); // Re-analyze because the empty MBB
            //  might be reused here.
            assert(GetInfo(*EmptyMBB)->FallThroughBB == nullptr);
          } else if (SBBI->IsReturn) {
            llvm_unreachable("Canonical CFG expected");
          } else if (SBBI->IsAligned) {
            // Create clone - The current successor has been aligned before.
            // Clone its original contents, if it has not been cloned before,
            //  and add CFG info and termination code. (A correct CFG is a
            //  precondition for TII->insertBranch.)
            assert(SBBI->Orig != nullptr);
            auto KV = Clones.find(SBBI->Orig);
            MachineBasicBlock *Clone = nullptr;
            if (KV != Clones.end()) {
              Clone = KV->second;
            } else {
              LLVM_DEBUG(dbgs() << "Cloning " << GetName(SBBI->BB) << "\n");
              Clone = CloneMBB(SBBI->Orig, true);
              Clones[SBBI->Orig] = Clone;
              for (auto SS : S->successors()) {
                Clone->addSuccessor(SS);
                // These successors will be cloned in turn during the next
                //  ComputeSuccessors call.
                // Ad-hoc pattern matching might prevent a cascade of cloning
              }

              // Update termination code
              // TODO: Fix copy-paste from
              //         MSP430NemesisDefenderPass::ReplaceSuccessor()::4
              TII->removeBranch(*Clone);
              if (SBBI->IsBranch) {
                if (SBBI->IsConditionalBranch) {
                  TII->insertBranch(*Clone, SBBI->TrueBB, SBBI->FalseBB,
                                    SBBI->BrCond, DebugLoc());
                  // Update taint analysis and containedness
                  //   - HasSecretDependentBranch is set during taint analysis
                  //   - IsPartOfSensitiveRegion is set during outer region analysis
                  GetInfo(*Clone)->HasSecretDependentBranch = true;
                  GetInfo(*Clone)->IsPartOfSensitiveRegion = true;
                } else {
                  TII->insertBranch(
                      *Clone, SBBI->TrueBB, nullptr, {}, DebugLoc());
                }
              } else {
                // A block with a successor cannot return
                assert(!SBBI->IsReturn);
                assert(SBBI->FallThroughBB != nullptr);
                TII->insertBranch(
                    *Clone, SBBI->FallThroughBB, nullptr, {}, DebugLoc());
              }

              R.Union.push_back(Clone);
            }

            // Update MBB
            ReplaceSuccessor(MBB, S, Clone);

            // Create/update CF analysis for the new/changed blocks. This
            //  analysis
            //  is required by the alignment algo. Make sure to do this after
            //  updating the basic block's termination code and the CFG.
            //   (not sure if the CFG is actually used for this,
            //      but let's be conservative)
            ReAnalyzeControlFlow(
                *MBB); // TODO: Already done by ReplaceSuccessor
            if (KV == Clones.end()) {
              AnalyzeControlFlow(*Clone);
            }
          } else {
            // Duplicates are not allowed in the Union
            if (Set.find(S) == Set.end()) {
              Set.insert(S);
              R.Union.push_back(S);
            }
          }
        }
      }
    }
  }

  // Check postcondition: There should be no duplicates in the Union.
  //
  // Remark: It is not possible to
  // use a std::set instead of a std::vector, because this would mean
  // that the order of insertion is not maintained. The order might be relevant
  // when effectively aligning the different blocks, because the order determines
  // the order in which the individual MBBs take the role as the reference block.
  std::set<MachineBasicBlock *> S(R.Union.begin(), R.Union.end());
  assert(S.size() == R.Union.size());

  return R;
}

#if 0
static void DumpMF(MachineFunction &MF) {
  LLVM_DEBUG(dbgs() << "==========================\n");
  for (auto &MBB : MF) {
    LLVM_DEBUG(dbgs() << MBB);
  }
  LLVM_DEBUG(dbgs() << "==========================\n");
}
#endif

void MSP430NemesisDefenderPass::AlignNonTerminatingInstructions(
    std::vector<MachineBasicBlock *> L) {
  assert(L.size() > 1);
  // Create two maps, mapping MBBs to
  //   1) instruction iterator (pointing to the beginning of the MBB)
  //   2) terminator iterator (pointing to branching code at end of MBB)
  // TODO: Map from MBB->getNumber -> MBB::iterator (and use more efficient map?)
  //         for this to work, blocks need to be correctly numbered which
  //         is currently not the case as ComputeSuccessors creates new MBBs
  std::map<MachineBasicBlock *, MachineBasicBlock::iterator> MII;
  std::map<MachineBasicBlock *, MachineBasicBlock::iterator> MTI;

  // 1) Initialize
  for (auto MBB : L) {
    // Don't add artifical blocks to BBAnalysis (by calling GetInfo) and,
    // consequently, don't mark artifical blocks as being aligned. This makes
    // sure that subsequent code safely ignores these blocks.
    // An example of an artifical block is the fingerprint block, which is used
    // to align a set of blocks with an previously aligned loop.
    if (MBB->getNumber() >= 0) {
      auto BBI = GetInfo(*MBB);
      assert(! BBI->IsAligned);
      BBI->IsAligned = true;
    }
    MII[MBB] = MBB->begin();
    MTI[MBB] = MBB->getFirstTerminator();
  }

  // 2) Align non-terminating instructions
  for (auto Ref : L) {

    LLVM_DEBUG(dbgs() << "Ref: " << GetName(Ref) << "\n");
    while (MII[Ref] != MTI[Ref]) {

      DebugLoc DL; // FIXME: Where to get DebugLoc from?

