hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
      // 2.1) First check if we are dealing with a call instruction in the
      //       current iteration.
      bool isCall = false;
      auto MBBI = L.begin();
      while ( (MBBI != L.end()) && (! isCall)) {
        auto BB = *MBBI++;
        if ((MII[BB] != BB->end()) && (MII[BB] != MTI[BB])) {
          auto &MI = *MII[BB];
          if (MI.isCall()) {

            // TODO: Reduce time-complexity (this is the third nested loop)
            for (auto BB2 : L) {
              if (BB2 != BB) {
                CompensateCall(MI, *BB2, MII[BB2]);
              }
            }
            MII[BB]++;

            isCall = true; // A call has been found. the Terminate loop.
          }
        }
      }

      // 2.2) Continue with the generic compensation logic for all other
      //       types of instruction when no call has been detected
      if (! isCall) {
        auto &RI = *MII[Ref]++;
        auto RIL = TII->getInstrLatency(nullptr, RI);
        LLVM_DEBUG(dbgs() << " " << RI << " (latency=" << RIL << ")\n");
        for (auto BB : L) {
          if (BB != Ref) {
            LLVM_DEBUG(dbgs() << "  " << GetName(BB) << ": ");
            if (MII[BB] == BB->end()) {
              LLVM_DEBUG(dbgs() << "insert nop (end-of-block)");
              CompensateInstr(RI, *BB, MII[BB]);
            } else if (MII[BB] == MTI[BB]) {
              LLVM_DEBUG(dbgs() << "insert nop (begin-of-branching-code)");
              CompensateInstr(RI, *BB, MII[BB]);
            } else {
              auto &MI = *MII[BB];
              auto MIL = TII->getInstrLatency(nullptr, MI);
              LLVM_DEBUG(dbgs() << MI << " (latency=" << MIL << "): ");
              if (RIL != MIL) {
                LLVM_DEBUG(dbgs() << "insert nop (non-matching-latency)");
                CompensateInstr(RI, *BB, MII[BB]);
              } else {
                LLVM_DEBUG(dbgs() << "latencies match");
                MII[BB]++;
              }
            }
            LLVM_DEBUG(dbgs() << "\n");
          }
        }
      }
    }

    assert(MII[Ref] == MTI[Ref]);
  }
}


// TODO: Generalize this implemenation. Now it is MSP430-specific and
//       only support two terminating instructions (according to the well-
//       formedness criterium).
// TODO: Optimize. It is not always necessary to assume that there are
//           always two terminating instructions...
void MSP430NemesisDefenderPass::AlignTerminatingInstructions(
    MachineBasicBlock *MBB) {
  auto T = MBB->getFirstTerminator();
  //LLVM_DEBUG(dbgs() << *MBB);
  //LLVM_DEBUG(dbgs() << *T);
  auto BBI = GetInfo(*MBB);
  switch (BBI->TerminatorCount) {
    case 0:
      assert(! BBI->IsBranch);
      assert(BBI->FallThroughBB != nullptr);
      BuildNOP2(*MBB, T, TII);
      BuildNOP2(*MBB, T, TII);
      break;
    case 1:
      if (BBI->IsConditionalBranch) {
        assert(BBI->FallThroughBB != nullptr);
        BuildNOP2(*MBB, T, TII);
        assert(TII->getInstrLatency(nullptr, *T++) == 2);
      }
      else if (BBI->IsReturn) {
        assert(TII->getInstrLatency(nullptr, *T) == 3);
        llvm_unreachable("Canonical CFG expected");
      }
      else {
        //LLVM_DEBUG(DumpMF(*MF));
        //LLVM_DEBUG(dbgs() << *MBB);
        assert(BBI->IsBranch);
        assert(BBI->FallThroughBB == nullptr);
        BuildNOP2(*MBB, T, TII);
        assert(TII->getInstrLatency(nullptr, *T++) == 2);
      }
      break;
    case 2:
      assert(BBI->IsConditionalBranch);
      assert(TII->getInstrLatency(nullptr, *T++) == 2);
      assert(TII->getInstrLatency(nullptr, *T++) == 2);
      break;
    default:
      llvm_unreachable("Invalid terminator count");
  }

  assert(T == MBB->end());
}

// Adds the definition with the highest id from Defs to the list of
//  candidate dependencies for the given instruction.
//  Returns true if a dependency has been added, false otherwise (empty Defs)
//
// PRE: The list of defs contains the instruction identifiers in MBB that
//   define the same register unit (RU)
// PRE: MI uses the thing that is defined
// PRE: Defs is sorted by increasing instruction id
bool MSP430NemesisDefenderPass::addDependency(MachineInstr *MI,
                                              MachineBasicBlock *MBB,
                                              std::vector<size_t> &Defs) {
  if (! Defs.empty()) {
    MBBInfo *BBI = GetInfo(*(MI->getParent()));
    auto IID = InstIds[MI];
    // The precondition states that the element in the back should corresponds
    //  to the instruction with the highest id.
    size_t DIID = Defs.back();
    assert(*(std::max_element(Defs.begin(), Defs.end())) == DIID);
    assert(DIID < MBB->size());
    MachineInstr *DMI = &*(std::next(MBB->begin(), DIID));
    BBI->Deps[IID].push_back(DMI);
#if 0
    LLVM_DEBUG(dbgs() << GetName(BBI->BB) << ":" << Id << " depends on "
               << GetName(MBB) << ":" << DIID << "\n");
#endif
    return true;
  }

  return false;
}

// Locates the instruction dependencies in a machine basic block of the given
// instruction MI with respect to the given register unit RU
// This method maintain a "visit list" to avoid endless recursion because of
// cycles in the CFG.
//  PRE: MI uses RU
//  PRE: MBB reaches MI
// TODO: Write unit test for ComputeDependencies
void MSP430NemesisDefenderPass::ComputeDependencies(
    MachineInstr *MI, size_t RU, MachineBasicBlock *MBB,
    SmallPtrSetImpl<MachineBasicBlock *> &Visited) {
  if (Visited.find(MBB) != Visited.end())
    return;

  Visited.insert(MBB);

  assert(MI != nullptr);
  assert(MBB != nullptr);
  assert(MI->getParent() != nullptr);
  MBBInfo *BBI = GetInfo(*(MI->getParent()));
  assert(BBI != nullptr);
  assert(InstIds.find(MI) != InstIds.end());
  auto IID = InstIds[MI];
  // Id is used to index BBI->Deps, assert it is within its bounds
  assert(IID < BBI->Deps.size());
  if (BBI->BB == MBB) {
    // If the MI's MBB defines the RU itself, register the def if the def site
    //  comes before MI. Don't look at the predecessors and leave early when
    //  this is the case.
    auto V = GetDefsBefore(BBI, RU, IID);
    if (addDependency(MI, MBB, V)) {
      // There is an instruction before MI in MI's MBB that defines RU
      return;
    }
  }

