hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
#if 0
  // TODO
  if (MBB->pred_size() == 0) {
    LLVM_DEBUG(dbgs() << "WARNING: Unitialized reg found\n");
  }
#endif

  for (MachineBasicBlock *PMBB : MBB->predecessors()) {
    auto PBBI = GetInfo(*PMBB);
    if (PMBB == MBB) {
      // Self-cycles can be safely ignored unless MBB is the MI's parent.
      if (BBI->BB == MBB) {
        if (GetDefsBefore(BBI, RU, IID).empty()) {
          // If addDependency returns true, then there is an instruction after
          //  MI in MI's MBB that defines RU.
          //  Since this is a cycle, this def reaches MI.
          auto V = GetDefsAfter(BBI, RU, IID);
          (void) addDependency(MI, MBB, V);
        }
      }
      // Don't recurse for self-cycles
    }
    else {
      assert(RU < PBBI->Defs.size());
      if (! addDependency(MI, PMBB, PBBI->Defs[RU])) {
        // Recursion terminates when the entry MBB has been reached
        //  since the entry MBB does not have any predecessors
        ComputeDependencies(MI, RU, PMBB, Visited);
      }
    }
  }
}

// The results are stored as dependencies between machine instructions which
//  is enough to implement the Nemesis defense.
void MSP430NemesisDefenderPass::ComputeReachingDefs() {
  // Compute reaching definitions
  for (auto &&KV : BBAnalysis) {
    MBBInfo &BBI = KV.second;
    for (MachineInstr &MI : BBI.BB->instrs()) {
      for (MachineOperand &MO : MI.operands()) {
        // TODO: To be portable, deal with two-operand instructions whers
        //         a register can be both defined and used
        if (MO.isReg() && MO.isUse()) {
          assert(! MO.isDef());
          MCRegUnitIterator RUI(MO.getReg(), TRI);
          assert(RUI.isValid());
          auto RU = *RUI;
          ++RUI;
          assert(!RUI.isValid());
          assert(RU < TRI->getNumRegUnits());
          assert(RU < BBI.Defs.size());

          SmallPtrSet<MachineBasicBlock *, 4> Visited;
          ComputeDependencies(&MI, RU, BBI.BB, Visited);
        }
        else {
          // TODO: Do something similar for stack slots
          // if (MO.isFI()) ...
        }
      }
    }
  }
}

bool MSP430NemesisDefenderPass::IsSecretDependent(MachineInstr *MI) {
  return TaintInfo.find(MI) != TaintInfo.end();
}

bool MSP430NemesisDefenderPass::IsSecretDependent(MBBInfo *BBI) {
  return BBI->HasSecretDependentBranch;
}

// Marks the given machine instruction as tainted
void MSP430NemesisDefenderPass::Taint(MachineInstr * MI) {
  TaintInfo.insert(MI);

  //LLVM_DEBUG(dbgs() << GetName(MI->getParent()) << ": Tainting " << *MI);

  if (MI->isConditionalBranch()) {
    assert(MI->getParent() != nullptr);
    auto L = MLI->getLoopFor(MI->getParent());
    /* Loop latches are treated differently than ordinary branches and are not 
     *  considered "ordinary" secret dependent branches.
     */
    if (L == nullptr || (! L->isLoopLatch(MI->getParent()))) {
      auto BBI = GetInfo(*MI->getParent());
      BBI->HasSecretDependentBranch = true;
      HasSecretDependentBranch = true;
    }
  }
}

// An instruction I is part of a sensitive region S if
//   - the entry node of S is a predecessor of I's parent
//   - the exit node of S post-dominates I
//
// TODO: OPTIMIZE
//        - Avoid checking this again for every instruction in a block !
//        - Are there better ways to compute this information ?
//           (is it possible to compute MBBInfo::IsPartOfSensitiveRegion earlier
//             and use the result of that analysis (if this is the case,
//             this method only needs to check wether MI's parent's BBInfo
//             has this flag set to true)
bool
MSP430NemesisDefenderPass::IsPartOfSensitiveRegion(const MachineInstr *MI) {
  bool Result = false;

  auto MBB = MI->getParent();
  assert(MBB != nullptr);

  std::vector<MachineBasicBlock *> Preds(MBB->pred_begin(), MBB->pred_end());
  SmallPtrSet<MachineBasicBlock *, 4> Visited;

  while ( (! Preds.empty()) && (! Result) ) {
    auto PMBB = Preds.back();
    Preds.pop_back();
    if (Visited.find(PMBB) == Visited.end()) {
      Preds.insert(Preds.end(), PMBB->pred_begin(), PMBB->pred_end());
      Visited.insert(PMBB);
      auto BBI = GetInfo(*PMBB);
      if (BBI->HasSecretDependentBranch) {
        auto IPDom = (*MPDT)[PMBB]->getIDom();
        if (IPDom->getBlock() != nullptr) {
          if (MPDT->properlyDominates(IPDom->getBlock(), MBB)) {
            Result = true;
          }
        }
        else {
          // If we get here, the entry node of a sensitive region does not
          // have an immediate dominator. Conforming to the well-formedness
          // criterion, this is only possible if the sensitive region contains a
          // return node,
          //  (TODO: Verify this assumption)
          // in which case, the canonical exit node should act as
          // the immediate dominator. This makes the given instruction
          // part of the sensitive region because:
          //   (1) the secret-dependent node reaches the instruction and
          //   (2) the unique canonical exit node is the immediate dominator
          //       of the secret-dependent node and
          //   (3) the unique canonical exit node dominates every node in the
          //       CFG, including the parent of the given instruction

          // Create the canonical exit node when it has not been created before
          if (CanonicalExit == nullptr) {
            CanonicalExit = CreateMachineBasicBlock("exit", true);
            DebugLoc DL; // FIXME: Where to get DebugLoc from?
            BuildMI(CanonicalExit, DL, TII->get(MSP430::RET));
          }

          Result = true;
        }
      }
    }
  }

  return Result;
}

// Safe taint analysis (uses use-def chain, the result of the
//  reaching definitions analysis) to statically track confidential
//  information. At first, only analyze registers, and conservatively
//  consider the rest as secret. To be extended
//  to stack slots and global variables.
//
// During taint analysis, it is also determined whether the CFG needs to be
// canonicalized, i.e. transformed to a CFG with a single exit point (via calls
// to IsPartOfSensitiveRegion()). This analysis could not be done earlier,
// because there was no taint info yet.
//
// !TODO: Desperately needs optimization
//         - Implement this as a worklist algo (needs a def-use chain)
//         - Store the taint info in MBBInfo instead of a MF-level set?
void MSP430NemesisDefenderPass::PerformTaintAnalysis() {
  size_t N = 0;
  while (TaintInfo.size() > N) {
    N = TaintInfo.size();
    for (auto &MBB : *MF) {
      // Ignore the canonical exit node. Code asserts because the reaching def
      // analysis has not been peformed on this node. (Fix this?)
      if (&MBB == CanonicalExit)
        continue;

      //LLVM_DEBUG(dbgs() << MBB);
      auto BBI = GetInfo(MBB);
      for (auto &MI : MBB.instrs()) {
        auto IID = InstIds[&MI];
        assert(IID < BBI->Deps.size());
        if (TaintInfo.find(&MI) == TaintInfo.end()) {

          if (MI.isInlineAsm()) {
            llvm_unreachable("Inline assembly is not supported");
          }

