hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
          if (MI.isCall()) {
            // TODO: the call should only be marked tainted if one of the
            //       actual parameters is marked tainted
            Taint(&MI);
            //continue;
          }

          // Mark every conditional branch that is part of a sensitive region
          // senstive in turn. (except for loop latches, see Taint())
          if (MI.isConditionalBranch()) {
            if (IsPartOfSensitiveRegion(&MI)) {
              Taint(&MI);
            }
          }

          for (auto &MO : MI.operands()) {
            if (TaintInfo.find(&MI) != TaintInfo.end()) {
              break;
            }
            // !TODO: Gradually support more cases, by adding more test
            //         cases
            switch (MO.getType()) {

              case MachineOperand::MO_Register         :
                if (MO.isUse()) {
                  for (auto DMI : BBI->Deps[IID]) {
                    if (IsSecretDependent(DMI)) {
                      Taint(&MI);
                    }
                  }
                }
                if (MO.isDef()) {
                  // Any assignment in a sensitive region taints the assigned
                  // variable.
                  if (IsPartOfSensitiveRegion(&MI)) {
                    Taint(&MI);
                  }
                }
                break;

              case MachineOperand::MO_Immediate        :
              case MachineOperand::MO_CImmediate       :
              case MachineOperand::MO_FPImmediate      :
                // Immediates don't leak information
                break;

              case MachineOperand::MO_MachineBasicBlock:
                // Used by (un)conditional jumps
                break;

              case MachineOperand::MO_GlobalAddress    :
                // Be conservative and mark as tainted
                Taint(&MI);
                break;

                // TODO: Gradually support more operand types
              case MachineOperand::MO_ExternalSymbol   :
              case MachineOperand::MO_ConstantPoolIndex:
              case MachineOperand::MO_MCSymbol         :
              case MachineOperand::MO_FrameIndex       :
              case MachineOperand::MO_BlockAddress     :
              case MachineOperand::MO_TargetIndex      :
              case MachineOperand::MO_JumpTableIndex   :
              case MachineOperand::MO_RegisterMask     :
              case MachineOperand::MO_RegisterLiveOut  :
              case MachineOperand::MO_Metadata         :
              case MachineOperand::MO_CFIIndex         :
              case MachineOperand::MO_IntrinsicID      :
              case MachineOperand::MO_Predicate        :
              default:
#if !defined(NDEBUG) || defined(LLVM_ENABLE_DUMP)
                LLVM_DEBUG(dbgs() << GetName(&MBB) << "\n");
                MI.dump();
#endif
                llvm_unreachable("Unknown operand type");
            }
          }
        }
      }
    }
  }
}

// Matchess the fork pattern. Typical for this pattern is that the branches 
// never join again.
//
//       EMBB
//      _/ \_
//      |   |
//      |  RBB1---> exit
//      |
//     LBB2
//
// !TODO: Generalize the fork pattern
bool MSP430NemesisDefenderPass::MatchFork(MBBInfo &EBBI) {
  MBBInfo *TBBI = GetInfo(*EBBI.TrueBB);
  MBBInfo *FBBI = GetInfo(*EBBI.FalseBB);

  assert(TBBI != FBBI);

  if (TBBI->IsReturn && FBBI->IsReturn) {
    EBBI.BClass = BCFork;
    auto &F = EBBI.BCInfo.Fork;
    F.LeftBB = TBBI->BB;
    F.RightBB = FBBI->BB;
    return true;
  }

  return false;
}

// Matches the triangle pattern.
//
//   Diverges on true edge:       Diverges on false edge:
//
//           EMBB                         EMBB
//           | \_                         | \_
//           |  |                         |  |
//           | TMBB                       | FMBB
//           |  /                         |  /
//           FMBB                         TMBB
//
// !TODO: Generalize the triangle pattern
bool MSP430NemesisDefenderPass::MatchTriangle(MBBInfo &EBBI, bool DivOnFalse) {
  MBBInfo *DivBBI = GetInfo(*EBBI.TrueBB);
  MBBInfo *JoinBBI = GetInfo(*EBBI.FalseBB);
  if (DivOnFalse) {
    DivBBI = GetInfo(*EBBI.FalseBB);
    JoinBBI = GetInfo(*EBBI.TrueBB);
  }

  if (DivBBI->Next == JoinBBI->BB) {
    EBBI.BClass = BCTriangle;
    auto &T = EBBI.BCInfo.Triangle;
    T.DivBB = DivBBI->BB;
    T.JoinBB = JoinBBI->BB;
    return true;
  }

  return false;
}

// Matches the diamond pattern.
//
//       EMBB
//      _/ \_
//      |   |
//    LMBB RMBB
//       \ /
//      JMBB
//
// !TODO: Generalize the triangle pattern
bool MSP430NemesisDefenderPass::MatchDiamond(MBBInfo &EBBI) {
  return false;
}

// The branch classifier considers only 'tainted' basic blocks as starting
//  points of the analysis. The result of this classification is input for
//  the alignment code generator.
void MSP430NemesisDefenderPass::ClassifyBranches() {
  for (auto &&KV : BBAnalysis) {
    MBBInfo &BBI = KV.second;
    if (IsSecretDependent(&BBI)) {
      // Preconditions for matching functions
      assert(BBI.IsAnalyzable);
      assert(BBI.IsConditionalBranch);
      assert(BBI.TrueBB != nullptr);
      assert(BBI.FalseBB != nullptr);
      assert(BBI.TrueBB != BBI.FalseBB);
      if (!MatchFork(BBI))
      if (!MatchDiamond(BBI))
      if (!MatchTriangle(BBI, true))
      if (!MatchTriangle(BBI, false)) {
#if 0
        BBI.BB->dump();
        llvm_unreachable("TODO: Support more branch pattern classes");
#endif
      }
    }
  }
}

// ! TODO: Figure out if inserting (or removing) an element into an ilist does
//         not invalidate iterators or pointers to other elements in the list.
//
// Inserts a compensation instruction before the given position in the given
// MachineBasicBlock.
//
// TODO: Verify correctness of these nops (see also the note in the MSP430x1xx
//                                            Family User's guide).
//
void MSP430NemesisDefenderPass::CompensateInstr(const MachineInstr &MI,
                                                MachineBasicBlock &MBB,
                                                MachineBasicBlock::iterator I) {
  auto Latency = TII->getInstrLatency(nullptr, MI);

