hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
static MachineLoop * 
getLoopFromHeader(MachineLoopInfo *MLI, MachineBasicBlock *Header) {
  auto L = MLI->getLoopFor(Header);
  assert(L != nullptr);
  assert(L->getHeader() != nullptr);
  assert(L->getHeader() == Header);
  return L;
}

// Aligns all MBBs with the given fingerprint
//
// Returns the list of successors of all sensitive regions, including the newly
//  ceated ones. This is required for the next call to ComputeSuccessors to
//  compute the successors based on the correct set.
//
// Remark: Recomputes analysis passes
//
// FIXME: Contains a recursive call that invalidates all pointers in 
//          analysis results. (see !!TODOS in body of this function)
//        (AlignFingerprint calls RedoAnalysisPasses...)
//
// TODO: Generalize to support arbitary regions (e.g. can be used as primitive
//     for ad-hoc, pattern-based optimizations (see notes))
std::vector<MachineBasicBlock *>
MSP430NemesisDefenderPass::AlignFingerprint(
    std::shared_ptr<Fingerprint> FP, std::vector<MachineBasicBlock *> MBBs) {

  DebugLoc DL; // FIXME: Where to get DebugLoc from?

  // Get necessary loop information
  assert(FP->LoopHeader != nullptr);
  // LTODO: In a generalized implemtation, it is necessary to check first that
  //   FP.LoopHeader <> nullptr
  auto FPLoop = getLoopFromHeader(MLI, FP->LoopHeader);
  auto LoopPreheader = FPLoop->getLoopPreheader();
  auto Header = FPLoop->getHeader();
  auto LoopLatch = FPLoop->getLoopLatch();
  auto ExitBlock = FPLoop->getExitBlock();

  auto BBIH = GetInfo(*Header);
  assert(BBIH->IsPartOfSensitiveRegion);
  assert(BBIH->IsLoopHeader);
  assert(BBIH->TripCount > 0);

  std::vector<MachineBasicBlock *> Result;

  // TODO: Optimize generated code for size, by 1) putting the generated loop in
  //        a separate block and 2) generating calls to this block

  // Start of loopification
  //   The generated code for loopification will be compensated for in the
  //    control-flow path of Loop (See code after this for-loop)
  LLVM_DEBUG(dbgs() << ">> START OF LOOPIFICATION (H=" 
      << GetName (FP->LoopHeader) << " TC=" << BBIH->TripCount << ")\n");

  // Pick an arbitrary register to act as the "induction register"
  unsigned IVar = MSP430::R10;

  // Align the artifical loop latch(es) with the "real loop latch", after adding
  //     instructions to
  //   - increment the induction variable
  //   - compare the induction variable with the trip count
  //
  // REMARK: The loop latch needs to be treated separately from the rest of
  //   the loop because of these two instructions. These instructions might
  //   give rise to compensating instructions in the "real loop latch", which is
  //   not the case for the other blocks of the loop.
  //
  // Do this once for all MMBs.
  auto TLatch = CreateMachineBasicBlock("temp-latch", false);
  BuildMI(TLatch, DL, TII->get(MSP430::ADD16ri), IVar).addReg(IVar).addImm(1);
  BuildMI(TLatch, DL, TII->get(MSP430::CMP16ri), IVar).addImm(BBIH->TripCount);
  // !!!LTODO: very ugly (find a better way to deal with this)
  bool AlreadyAligned = GetInfo(*LoopLatch)->IsAligned; // LTODO: UGLY
  if (!AlreadyAligned) {
    AlignNonTerminatingInstructions({LoopLatch, TLatch});
    // Because of the "branch compensating" operation, aligning with the
    // latch is an operation that is not idempotent.
    // This is important because the recursive nature of 
    // this function might result in invocating AlignNonTerminatingInstructions 
    // more than once for nested loops. (see region-loop-loop-tail.c with -O3)
    BuildBranchCompensator(*LoopLatch, LoopLatch->begin(), TII); // !!! LTODO: Document where this comes from
  }
  else {
    // Avoid compensating for extra jump over and over again (operation is not 
    //   idempotent)
    auto BBI = GetInfo(*LoopLatch);
    auto CLatch = CloneMBB(BBI->Orig, false);
    AlignNonTerminatingInstructions({CLatch, TLatch});
  }

  // After aligning the MBBs, the loop-header and the loop-exit need to be
  // compensated for the artifical loop-headers and artificial loop-exits
  // Therefore, LPH and LExit need to be visible in this scope.
  MachineBasicBlock *LPH = nullptr;
  MachineBasicBlock *LExit = nullptr;

  // First, align each of the MBBs
  for (auto MBB : MBBs) {
 
    assert(MBB->succ_size() == 1); // Guaranteed by ComputeSuccessors
    auto Succ = *MBB->succ_begin();

    LLVM_DEBUG(dbgs() << ">>>> LOOPIFY FOR " << GetName(FP->LoopHeader) 
        << " @ " << GetName(Succ) << "\n");

    LPH = MBB; /* MBB will be the loop preheader */
    auto LHeader = CreateMachineBasicBlock("loop-header", true);
    auto LLatch = CreateMachineBasicBlock("loop-latch", true);
    //GetInfo(*LHeader)->Orig = CloneMBB(EmptyMBB, false); // LTODO ?
    LExit = CreateMachineBasicBlock("loop-exit", true);

    // 1) - Add instructions to LPH that
    //      o push the current value of induction register on the stack
    //      o initialize the induction register
    //    - Set the loop header as its successor
    auto T = LPH->getFirstTerminator();
    assert(T != nullptr); // Guaranteed by ComputeSuccessors
    BuildMI(*LPH, T, DL, TII->get(MSP430::PUSH16r), IVar);
    BuildMI(*LPH, T, DL, TII->get(MSP430::MOV16ri), IVar).addImm(0);
    ReplaceSuccessor(LPH, Succ, LHeader);

    // 2) - Align the loop header with the loop fingerprint (modulo latch (!))
    //      The loop fingerprint is empty when the loop consists of a single
    //      MBB (in which case the MBB is both loop header and loop latch)
    //    - Set loop-latch as successor
    if (FP->Head->size() > 0) {
      // It is ok to pass FP->Head several times to the alignment function
      //  because LHeader will be empty each time at this point in the program.
      //  If this would not be the 
      //  case, FP->Head _could_ change after each invocation the alignment 
      //  function, in which case LHeader should be aligned against a copy of
      //  FP->Head.
      // LTODO: 
      //    1) Maybe it is a better idea to do it once outside of this loop
      // in a "temp-header" and copy its contents for every MBB in MBBs, similar
      // to the "temp-latch" block.
      //    2) Or maybe it is even better to just copy the contents of FP->Head
      //       here, since it exclusively exists of "dummy" instructions.
      assert(LHeader->size() == 0 && "Header not empty");
      AlignNonTerminatingInstructions({FP->Head, LHeader});
    }
    LHeader->addSuccessor(LLatch);
    TII->insertBranch(*LHeader, LLatch, nullptr, {}, DL); // !!LTODO: Compensate for this in "real loop"

    // 3) - Populate the loop latch (by copying instructions from temp-latch)
    //    - Connect loop-latch to loop-header and loop-exit by adding
    //       o a conditional jump to the loop header with the correct condition
    //       o an unconditional jump to the loop exit
    for (auto &MI : *TLatch) {
      MF->CloneMachineInstrBundle(*LLatch, LLatch->end(), MI);
    }
    LLatch->addSuccessor(LHeader);
    LLatch->addSuccessor(LExit);
    auto BrCond = MachineOperand::CreateImm(MSP430CC::CondCodes::COND_L);
    TII->insertBranch(*LLatch, LHeader, LExit, BrCond, DL);

    // 4) Restore the value of the induction register and connect the exit block
    //    to MBB
    BuildMI(LExit, DL, TII->get(MSP430::POP16r), IVar);
    LExit->addSuccessor(Succ);
    TII->insertBranch(*LExit, Succ, nullptr, {}, DL);

