hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
    // 5) Analyze control flow for newly created blocks
    AnalyzeControlFlow(*LPH);
    AnalyzeControlFlow(*LHeader);
    AnalyzeControlFlow(*LLatch);
    AnalyzeControlFlow(*LExit);

    // 6) Deal with nested loops (must be done _after_ analyzing the CF of
    //     the newly created blocks)
    for (auto &Tail : FP->Tail) {
      // Tail is a (Fingerprint, MBB) pair
      assert(Tail.first != nullptr);

#if 1 // !!!LTODO
        assert(LLatch->pred_size() == 1);
        auto Pred = *LLatch->pred_begin();
        auto EmptyMBB = CreateMachineBasicBlock("empty-for-loopif", true);
        //GetInfo(*EmptyMBB)->Orig = CloneMBB(EmptyMBB, false);
        ReplaceSuccessor(Pred, LLatch, EmptyMBB);
        EmptyMBB->addSuccessor(LLatch);
        TII->insertBranch(*EmptyMBB, LLatch, nullptr, {}, DebugLoc());
        AnalyzeControlFlow(*EmptyMBB);
#endif

      AlignFingerprint(Tail.first, {EmptyMBB});

      // Align with the rest (tail) of fingerprint
      // LTODO: Same remark here as for aligning FP->Head (see above)
      auto TailBB = CreateMachineBasicBlock("tail", true);
      assert(TailBB->size() == 0 && "Header not empty");
      AlignNonTerminatingInstructions({Tail.second, TailBB});

      assert(LLatch->pred_size() == 1);
      Pred = *LLatch->pred_begin(); // Should be exit block of nested loop
      assert(Pred->pred_size() == 1);
      auto PredPred = *Pred->pred_begin(); // Should be latch of nested loop

      // Sanity check: LHeader should be disconnnected from LLatch at this point
      assert(!LHeader->isSuccessor(*LLatch->pred_begin()));

#if 1
      // More santity checks: At this point in the program, the unique 
      //   predecessor of the latch should be the latch of another loop.
      assert(MLI->getLoopFor(Pred) != nullptr);
      auto L = getLoopFromHeader(MLI, LHeader);
      assert(MLI->getLoopFor(Pred) == L);
      assert(MLI->getLoopFor(PredPred) != nullptr);
      assert(MLI->getLoopFor(PredPred)->getLoopLatch() != nullptr);
      assert(MLI->getLoopFor(PredPred)->getLoopLatch() == PredPred);
#endif

      // Insert TailBB between Pred and LLatch
      ReplaceSuccessor(Pred, LLatch, TailBB);
      TailBB->addSuccessor(LLatch);
      TII->insertBranch(*TailBB, LLatch, nullptr, {}, DL); // !!!LTODO: Compensate for this in "real loop"

      AnalyzeControlFlow(*TailBB);
    }

#if 0
    // 7) Updated IsAligned information:
    //  These MBBs will be aligned at the end of the current function
    //  invocation.
    GetInfo(*PH)->IsAligned = true;
    GetInfo(*LExit)->IsAligned = true;
    GetInfo(*Succ)->IsAligned = true;
#endif

    // Make sure that ComputeSuccessors computes the correct successor in the
    //  current control-flow path (starting from the newly created exit node).
    Result.push_back(LExit);

    // CHECK POSTCONDITION:
    // -> The latch should end with a conditional jump, followed by an 
    // unconditional jump
    assert(std::distance(LLatch->terminators().begin(),
                         LLatch->terminators().end()) == 2);
  }

  // Compensate for the loopification in the real loop
  //  by creating a new loop-preheader and loop-exit blocks
  // (LTODO: OPTIMIZE
  //     This can probably be avoided, by creating a temp-pheader and a
  //      temp-exit similar to the temp-latch above...)
  if (! AlreadyAligned) {
    auto NewLoopPreheader = CreateMachineBasicBlock("loop-pheader", true);
    assert(LPH != nullptr); //  Any PH will do as a reference, so let's take the last one
    //GetInfo(*PH)->IsAligned = false; // Avoid assert from begin triggered
    AlignNonTerminatingInstructions({NewLoopPreheader, LPH});
    NewLoopPreheader->addSuccessor(Header);
    TII->insertBranch(*NewLoopPreheader, Header, nullptr, {}, DL);
    ReplaceSuccessor(LoopPreheader, Header, NewLoopPreheader);

    auto NewExitBlock = CreateMachineBasicBlock("loop-exit", true);
    assert(LExit != nullptr); //  Any LExit will do as a reference, so let's take the last one
    //GetInfo(*LExit)->IsAligned = false; // Avoid assert from being triggered
    AlignNonTerminatingInstructions({NewExitBlock, LExit});
    NewExitBlock->addSuccessor(ExitBlock);
    TII->insertBranch(*NewExitBlock, ExitBlock, nullptr, {}, DL);
    ReplaceSuccessor(LoopLatch, ExitBlock, NewExitBlock);

    // Make sure the successor of the loop will be computed correctly by
    //  the next call to ComputeSuccessors...
    Result.push_back(NewExitBlock);

    // Analyze CF for newly created blocks
    AnalyzeControlFlow(*NewLoopPreheader);
    AnalyzeControlFlow(*NewExitBlock);
  }

  LLVM_DEBUG(dbgs() << ">> END OF LOOPIFICATION (" << GetName (FP->LoopHeader) 
      << ")\n");

  // CHECK POSTCONDITION:
  // -> The latch should end with a conditional jump, followed by an unconditional
  //     jump
  assert(std::distance(LoopLatch->terminators().begin(),
                       LoopLatch->terminators().end()) == 2);

  RedoAnalysisPasses(); // TODO: Optimize (see remark at function definition)

  return Result;
}

// AlignSensitiveLoop peforms the following actions:
//  1) aligns all sensitive regions for which the "closest" loop is 'this' loop
//  2) Aligns all MBBs with the aligned loop region
//
//  It recursively deals with nested loops.
//
// Returns the list of successors of all the loop regions, including the newly
//  ceated ones. This is required for the next call to ComputeSuccessors to
//  compute the successors based on the correct set.
//
// Remark: AlignSensitiveLoop is mutually recursive with AlignSensitiveBranch
//
// Remark: Recomputes analysis passes
std::vector<MachineBasicBlock *>
MSP430NemesisDefenderPass::AlignSensitiveLoop(MachineLoop *Loop,
                                           std::vector<MachineBasicBlock *> MBBs) {
  // Get necessary loop information
  // AlignContainedRegions (below) and loopification (below) invalidates loop
  // analysis. Also, loop analysis seems to depend on CFG and/or termination
  // code.
  auto LoopPreheader = Loop->getLoopPreheader();
  auto Header = Loop->getHeader();
  auto LoopLatch = Loop->getLoopLatch();
  auto ExitBlock = Loop->getExitBlock();

