hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
  // Verify wel-formedness criterion
  assert(LoopPreheader != nullptr);
  assert(Header != nullptr);
  assert(LoopLatch != nullptr);
  assert(ExitBlock != nullptr);
  assert(LoopLatch->isSuccessor(ExitBlock));
  assert(*LoopPreheader->succ_begin() == Header);

  // First align the contained regions (no straigh-line code) of this loop,
  //  because an aligned loop region is a precondition for GetFingerprint.
  AlignContainedRegions(Loop); // Recomputes analyses passes
  Loop = MLI->getLoopFor(Header);
  assert(Loop != nullptr); // Header should still be part of a loop
  assert(Header == Loop->getHeader());

  // Sanity check (AlignContainedRegions might change the CFG, but the
  //               special loop blocks should not change)
  assert(LoopPreheader == Loop->getLoopPreheader());
  assert(LoopLatch == Loop->getLoopLatch());
  assert(ExitBlock == Loop->getExitBlock());

  // GeFingerprint depends on a correct loop analysis (see comments above)
  return AlignFingerprint(GetFingerprint(Loop), MBBs);
}

void MSP430NemesisDefenderPass::RedoAnalysisPasses() {
  // !LTODO: It might be better to "maintain" the Loop information and the
  //   dominator tree instead of redoing the complete analysis over and over again
  //    (see for example MLI::addBasicBlockToLoop() which seems to exist for this)
  // TODO! How to enforce a re-anlysis of MLI and all passes it depends on in
  //        a cleaner and more automated and less hardcoded way
  //MF->viewCFG();
  MDT->runOnMachineFunction(*MF); // MLI depends on this
  //MDT->dump();
  MLI->runOnMachineFunction(*MF); // !!TODO: Is this the right way to do this?
}

// Aligns the sensitive branch that starts with BBI.BB
//
// When this function returns,
//   the sensitive branch defined by (BBI.BB, ExitOfSR) will be secure. All 
//   possible paths in the region will have same fingerprint. This means that
//   the complete region will be compensated for 
//     - unbalanced non-terminating instructions
//     - unbalanced terminating instructions
//     - unbalanced two-way branches
// Consequently, GetFingerprint() will return the correct fingerprint.
//
// Remark: Recomputes analysis passes
void MSP430NemesisDefenderPass::AlignSensitiveBranch(MBBInfo &BBI) {
#if 0
  switch (BBI.BClass) {
    case BCFork:
      AlignFork(BBI);
      break;
    case BCDiamond:
      AlignDiamond(BBI);
      break;
    case BCTriangle:
      AlignTriangle(BBI);
      break;
    case BCNotClassified:
      // ! TODO Enable this again
      llvm_unreachable("Unclassfied branch pattern");
      break;
    default:
      llvm_unreachable("Unknown branch pattern");
  }
#endif

  auto ExitOfSR = GetExitOfSensitiveBranch(BBI.BB);
  LLVM_DEBUG(dbgs() << "=== Align sensitive branch (" << GetName(BBI.BB) << ", "
                    << GetName(ExitOfSR) << ") ===\n");

  assert(!BBI.IsAligned);

  std::vector<MachineBasicBlock *> MBBs; // Keep track of aligned blocks

  // 1) Align non-terminating instructions
  Successors Succs;
  Succs = ComputeSuccessors({BBI.BB}, ExitOfSR);
  while (!Succs.Union.empty()) {
    // TODO: Make sure this loop terminates
    if (Succs.Loop == nullptr) {
      assert(Succs.Union.size() > 1);
      AlignNonTerminatingInstructions(Succs.Union);
      std::copy(Succs.Union.begin(), Succs.Union.end(), std::back_inserter(MBBs));
      Succs = ComputeSuccessors(Succs.Union, ExitOfSR);
    }
    else {
      // A loop has been detected by ComputeSuccessors, deal with it first
      auto Union = AlignSensitiveLoop(Succs.Loop, Succs.Union);
      Succs = ComputeSuccessors(Union, ExitOfSR);
    }
  }

  // 2) Align terminating instructions
  for (auto MBB : MBBs) {
    MBBInfo *BBI = GetInfo(*MBB);

    assert(BBI->IsAligned);

    // Aligning the termination instructions should be done after aligning
    // the non-termination instructions of all MBBs in the sensitive branch.
    // This is because the termination code can still change when aligning
    // one of the successor blocks (e.g. when an empty block is inserted).
    AlignTerminatingInstructions(BBI->BB);
  }

  // 3) Align two-way branches
  MBBs.push_back(BBI.BB); // Don't forget to include the entry block
  for (auto MBB : MBBs) {
    MBBInfo *BBI = GetInfo(*MBB);

    // Aligning two-way branches should be done after aligning the
    // non-terminating instructions because the instruction that gets inserted
    // in the true path, to compensate for the JMP in the false path,
    // does not have to be taken into account when aligning the MBBs at the
    // same level (See AlignBlocks), because technically this compensating 
    // instruction belongs the previous MBB (or you could say that it is an 
    // artifact of how two-way branches need to be represented in MIR).
    if (BBI->HasSecretDependentBranch) {
      if (BBI->IsConditionalBranch && (BBI->FallThroughBB == nullptr)) {
        assert(BBI->TerminatorCount == 2);
        AlignTwoWayBranch(*MBB);
      }
    }
  }

  LLVM_DEBUG(dbgs() << "=== Done ===\n");

  RedoAnalysisPasses(); // TODO: Optimize (see remark at function definition)
}

void MSP430NemesisDefenderPass::AnalyzeLoops() {
  for (auto &KV : BBAnalysis) {
    MBBInfo &BBI = KV.second;
    if (BBI.IsPartOfSensitiveRegion) {
      auto L = MLI->getLoopFor(BBI.BB);
      if ( (L != nullptr) && (BBI.BB == L->getHeader())) {
        // Verify wel-formedness criterion for loops
        // LTODO: check all constraints
        assert(L->getLoopPreheader() != nullptr);
        assert(L->getHeader() != nullptr);
        assert(L->getLoopLatch() != nullptr);
        assert(L->getExitBlock() != nullptr);
        assert(L->getLoopLatch()->isSuccessor(L->getExitBlock()));
        assert(*L->getLoopPreheader()->succ_begin() == L->getHeader());

        // LTODO: Document this better
        // Register that this block is the header of a loop.
        // In the nemdef pass, loops are represented by their header-MBB, a 
        // property for loops that is invariant in this pass. (The preheader 
        //  and exit blocks can be different before and after the 
        //  transformation.)
        // Loop data structures retured by MLI are invalidated when 
        //  loop analysis is recomputed. For this reason, it is not safe
        //   to store loop pointers in nemdef data structures since they
        //    can become dangling.
        // The nemdef transformation does not always preserves the
        //  well-formedness criterion. ComputeTripCount for example
        //  expects that the initialization of the induction register
        //  occurs in the preheader block. However, nemdef might introduce
        //  an new "artificial" loop between the preheader of a 
        //  well-formed loop and the actual loop 
        //   (see nemdef-loop-loop-tail-O3 for example)
        BBI.IsLoopHeader = true;

