hanswinderix/llvm-project/llvm/lib/Target/MSP430/MSP430NemesisDefender.cpp
      }
    } else {
      // Mark as un-analyzable
      O << GetName(BBI.BB) << " [color=purple];\n";
    }
  }

  O << "}\n";

  DisplayGraph(FN, false, GraphProgram::DOT);
}

void MSP430NemesisDefenderPass::PrepareAnalysis() {
  MF->RenumberBlocks();
#if 0  // Re-enable when BBAnalysis is a vector
  BBAnalysis.resize(MF->getNumBlockIDs());
#endif

  // Create dummy machine instructions at the beginning of the entry MBB to
  //  represent the CC defs. Add them to the taint set when their corresponding
  //  argument is marked "_secret". This allows for a uniform and therefore
  //  simpler taint analysis implementation.
  // TODO: Code is MSP430-specific and should be platform independent
  //        -> Possible use the generated info from the TableGen CallingConv 
  //            backend?
  // TODO: Get rid of Reg++
  auto &MBB = *GetEntryMBB(MF);
  auto MBBI = MBB.begin();
  auto DL   = MBBI->getDebugLoc();
  int Reg   = MSP430::R12;
  // TODO: Stop after 4 iterations (for MSP430 at least)
  for (auto &Arg : MF->getFunction().args()) {
    auto MI = BuildMI(MBB, MBBI, DL, TII->get(MSP430::MOV16ri), Reg++).addImm(0);
    if (IsSecret(Arg)) {
      TaintInfo.insert(MI);
    }
  }
}

void MSP430NemesisDefenderPass::FinishAnalysis() {
  // Remove the dummy machine instructions at the beginning of the entry MBB,
  //  representing the CC defs
  auto MBB = GetEntryMBB(MF);
  auto MBBI = MBB->begin();
  for (size_t i=0; i<MF->getFunction().arg_size(); i++) {
    auto MI = &*MBBI++;
    MBB->remove(MI);
  }
}

// Canonicalizes the CFG when necessary (determined during taint analysis).
// The canonicalization step transforms a CFG with multiple exit points into
// one where there is only one.
// TODO: Optimize
//        Now every return block is replaced with a branch block
//        while this is only required for return blocks in senstive regions
void MSP430NemesisDefenderPass::CanonicalizeCFG() {
  if (CanonicalExit != nullptr) {

    LLVM_DEBUG(dbgs() << "Canonicalize CFG\n");

    for (auto &MBB : *MF) {
      if (&MBB == CanonicalExit)
        continue;

      if (GetInfo(MBB)->IsReturn) {
        // Remove the return instruction, update CFG, termination code and
        // BBAnalysis
        DebugLoc DL; // FIXME: Where to get DebugLoc from?
        RemoveTerminationCode(MBB);
        MBB.addSuccessor(CanonicalExit);
        TII->insertBranch(MBB, CanonicalExit, nullptr, {}, DL);
        ReAnalyzeControlFlow(MBB);
      }
    }

    AnalyzeControlFlow(*CanonicalExit);

    // Don't forget to rebuild the post-dominator tree
    MPDT->runOnMachineFunction(*MF); // !!TODO: Is this the right way to do this?

    LLVM_DEBUG(dbgs() << "Canonicalization done\n");
  }
}

bool MSP430NemesisDefenderPass::runOnMachineFunction(MachineFunction &MF) {
  if (skipFunction(MF.getFunction()))
    return false;
  if (!Enable)
    return false;

  LLVM_DEBUG(dbgs() << "********** " << getPassName() << " : " << MF.getName()
                    << "**********\n");

  HasSecretDependentBranch = false;
  bool Changed = false;
  const TargetSubtargetInfo &STI = MF.getSubtarget();
  this->MF = &MF;
  //TII=static_cast<const MSP430InstrInfo *>(MF->getSubtarget().getInstrInfo());
  //TLI = STI.getTargetLowering();
  MRI = &MF.getRegInfo();
  TII = STI.getInstrInfo();
  TRI = STI.getRegisterInfo();
  MLI = &getAnalysis<MachineLoopInfo>();

  if (!TII) return false;

  MDT = &getAnalysis<MachineDominatorTree>();
  MPDT = &getAnalysis<MachinePostDominatorTree>();

  // TODO: assert(!MRI->isSSA());

  WriteCFG("before"); 

  if (EmitCFG) {
#if 0
    MF.viewCFG(); // Dump unhardened CFG before any possible changes
#else
    MF.viewCFGOnly(); // Dump unhardened CFG before any possible changes
#endif
  }

  // Perform analysis
  PrepareAnalysis();
  AnalyzeControlFlow();
  VerifyControlFlowAnalysis();
  ComputeReachingDefs();

  PerformTaintAnalysis();
  ClassifyBranches();
  FinishAnalysis();

  // Canonicalize CFG, if needed
  CanonicalizeCFG();

  if (EmitCFG) {
#if 0
    MF.viewCFG(); // Dump after canonicalization, before hardening
#else
    MF.viewCFGOnly(); // Dump after canonicalization, before hardening
#endif
  }

  // Analyses performed after canonicalization
  DetectOuterSensitiveBranches();
  AnalyzeLoops();

  // Generate hardening code
  //DumpDebugInfo();
  SecureCalls();
  AlignSensitiveBranches();
  //DumpDebugInfo();

  if (EmitCFG) {
    DumpCFG(); // Dump after hardening CFG
  }

  if (HasSecretDependentBranch)
    WriteCFG("after"); 

  return Changed;
}

void MSP430NemesisDefenderPass::releaseMemory() {
  BBAnalysis.clear(); // TODO: Does this also clear Defs and Deps?
  InstIds.clear();
  TaintInfo.clear();
}

#if 0
INITIALIZE_PASS_BEGIN(MSP430NemesisDefenderPass, DEBUG_TYPE,
                      "X86 cmov Conversion", false, false)
INITIALIZE_PASS_DEPENDENCY(MachineLoopInfo)
INITIALIZE_PASS_END(MSP430NemesisDefenderPass, DEBUG_TYPE,
                    "X86 cmov Conversion", false, false)
#endif
static RegisterPass<MSP430NemesisDefenderPass> X(DEBUG_TYPE,
                                                 "MSP430 Nemesis Defender Pass",
                                                 false /* Only looks at CFG */,
                                                 false /* Analysis Pass */);


FunctionPass *llvm::createMSP430NemesisDefenderPass() {
  return new MSP430NemesisDefenderPass();
}
